const id = "如何提一个好问题.mdx";
						const collection = "archive";
						const slug = "如何提一个好问题";
						const body = "\n## 什么是好问题\n  \n1. 角度（话术）  发现问题、推进某件事情\n2. 业绩：成果（产出）、能力\n3. 问题：个人问题，团队问题\n4. 计划：创造某类环境\n5. 价值\n\n> 好的问题对于回答者来说，是一份厚礼\n\n## 提问前的准备\n\t\t\n1. 尝试在你准备提问的论坛的旧文章中搜索答案。\n2. 尝试在Google或者百度等搜索引擎上搜索答案。\n3. 尝试阅读手册查找答案。\n4. 尝试阅读文档的常见问题（FAQ）查找答案。\n5. 尝试自己检查或者试验来找到答案。\n6. 向你身边的强者朋友打听来找到答案。\n7. 如果你是程序员，请尝试阅读源码来查找答案。\n\n> 好问题是是激励，是厚礼。  \n\n好问题可以提高我们的理解力，而且通常会暴露我们以前从没意识到或者思考过的问题。不愿思考、或者发问前不做他们该做的事的人，是时间杀手。他们只是一味的索取，从不付出。无知没有关系，装白痴就是不行。机敏、有想法、善于观察、乐于主动参与解决问题。\n\n## 如何提问？\n\n1. 向专家求助之前，先阅读下常见问题文件（FAQ） ，思考下问题。\n2. 慎选提问的论坛\n\t- 在与主题不符的论坛上贴出你的问题。\n\t- 在探讨进阶技术问题的论坛上张贴非常初级的问题；反之亦然。\n\t- 在太多的不同新闻组上重复转帖同样的问题。\n\t- 向既非熟人也没有义务解决你问题的人发送私人邮件。\n3. 仔细、清楚地描述你的问题或 Bug 的症状。\n4. 描述问题发生的环境（机器配置、操作系统、应用程序、以及相关的信息），提供经销商的发行版和版本号（如：Fedora Core 4、Slackware 9.1等）。\n5. 描述在提问前你是怎样去研究和理解这个问题的。\n6. 描述在提问前为确定问题而采取的诊断步骤。\n7. 描述最近做过什么可能相关的硬件或软件变更。\n8. 尽可能的提供一个可以重现这个问题的可控环境的方法。\n\n## 如何查找问题的解决方案？\n\n1. 尝试在你准备提问的论坛的旧文章中搜索答案。\n2. 尝试上网搜索以找到答案。\n3. 尝试阅读手册以找到答案。\n4. 尝试阅读常见问题文件（FAQ）以找到答案。\n5. 尝试自己检查或试验以找到答案。\n6. 向你身边的强者朋友打听以找到答案。\n7. 如果你是程序开发者，请尝试阅读源代码以找到答案。\n";
						const data = {title:"如何提一个好问题",description:"",pubDate:new Date(1693663689000),heroImage:""};
						const _internal = {
							type: 'content',
							filePath: "/Users/lihaizhong/Documents/Project/lihaizhong.blog/src/content/archive/如何提一个好问题.mdx",
							rawData: undefined,
						};

export { _internal, body, collection, data, id, slug };
